# Задача: Створіть дві змінні first=10, second=30. Виведіть на екран результат математичної взаємодії (+, -, *, / и тд.) для цих чисел.

a = 10
b = 30
print (a + b,a - b, a * b, a / b, a // b, a % b)

# Задача: Створіть змінну і почергово запишіть в неї результат порівняння (<, > , ==, !=) чисел з завдання 1. Виведіть на екран результат кожного порівняння

first = 10
second = 30
bool1 = first < second
bool2 = first > second
bool3 = first == second
bool4 = first != second
print(bool1, bool2, bool3, bool4)

# Задача: Створіть змінну - результат конкатенації (складання) строк str1="Hello " и str2="world". Виведіть на екран.

str1 = "Hello"
str2 = " world"
print(str1 + str2)